{
  "id": "6905c752adacdc0115f94145",
  "title": "Jim Crow's Ghost: Over 1,000 Languish in Louisiana Prisons Under Unconstitutional Jury Law",
  "slug": "jim-crows-ghost-over-1000-languish-in-louisiana-prisons-under-unconstitutional-jury-law",
  "excerpt": "Louisiana's non-unanimous jury law, a Jim Crow-era rule designed to nullify Black jurors' votes, was deemed unconstitutional by the U.S. Supreme Court and repealed by state voters. However, over 1,000 people, mostly Black, remain imprisoned under these now-illegal verdicts. Because the Supreme Court's ruling was not made retroactive, these individuals have no clear path to a new trial, leaving a legacy of injustice unresolved as statewide legislative reform efforts have stalled.",
  "content": "# An Unconstitutional Crisis\n\nAfter 120 years, the Supreme Court struck down the law as *unconstitutional*. Voters also rejected it. Yet, as of 2023, *more than 1,000 people—most of them Black—remain imprisoned* in Louisiana under this now-illegal system. Many are serving life sentences that the Supreme Court said amounted to *no verdict at all*.\n\nThe continued imprisonment of individuals under this overturned law presents an unresolved legal and social issue for the state. Although the law was created during the era of post-Reconstruction bigotry, its harmful effects continue to impact people even after it was officially ended. To understand this persistence, it is vital to consider the law's origins.\n\n# Historical Origins of the Non-Unanimous Jury Law\n\nTo see why this problem persists, we look at its origins. The non-unanimous jury rule was not a minor detail. It was created at Louisiana's 1898 Constitutional Convention. The leaders made their intentions clear. As one chairman said, the purpose was to *'establish the supremacy of the white race.'*\n\nThis rule was just one of many Jim Crow laws, like poll taxes, property tests for voting, and the Grandfather Clause. All aimed to keep Black citizens from political power.\n\nThe split-jury rule served two key, intertwined purposes:\n\n- **Economic Exploitation**: The rule helped the state's convict-leasing system, making Angola prison work like a slave plantation. With easier convictions, the state had a steady flow of cheap, mostly Black labor.\n\n- **Juridical Control**: The rule allows white-majority juries to overrule the few Black jurors. In *10-2* or *9-3* cases, Black jurors' opinions were ignored during deliberations.\n\n# A Disputed Precedent and a Movement for Reform\n\nFor over a century, the system stayed intact because courts did not intervene. It relied on the confusing 1972 Supreme Court case *Apodaca v. Oregon*. Justice Lewis Powell alone said the Sixth Amendment required unanimous verdicts in federal courts, *not in state courts*. This loophole kept the law alive for 48 more years. At the 1974 Constitutional Convention, delegates changed the rule from *9-3* to *10-2* but did not fix the unfair system.\n\nThe tide shifted after years of work by public defenders, civil rights lawyers, and former inmates. Academic research and journalism detailed the law’s racially discriminatory history. A 2018 Pulitzer-winning Advocate series showed Black defendants were *much more likely to be convicted by split juries*, and Black jurors' dissent was often overridden.\n\nWith strong evidence, a broad \"Yes on Two\" coalition—including both major parties, the ACLU, and conservative faith groups—brought the issue to voters. In 2018, *64% of Louisianans voted for unanimous verdicts* in serious crimes. But the new rule only applied to crimes after January 1, 2019, leaving many in legal limbo. Those convicted before then *cannot get a retrial or review*, even though old verdicts are now unconstitutional.\n\n# A Constitutional Reckoning, A Promise Denied\n\nIn *Ramos v. Louisiana*, the U.S. Supreme Court delivered the final blow. Evangelisto Ramos got life for a 2016 murder by a *10-2* jury. In a *6-3* decision, the Court ruled the Sixth Amendment requires unanimous verdicts in all courts, overturning *Apodaca*.\n\nThe Court addressed the law’s history directly. Justice Neil Gorsuch wrote it was designed to *\"ensure that African-American juror service would be meaningless.\"* Justice Brett Kavanaugh said the racist origins were *\"significant\"* to his analysis.\n\nBut *Ramos* raised a painful question: What happens to thousands like Thedrick Edwards, convicted by a *10-2* vote in 2007 and still serving life? In 2021, the Court decided *Ramos* would not apply to finalized cases. The focus shifted to finality rather than correcting the mistake. The state that kept the system for 120 years must now decide.\n\n# The Impact on Individuals Convicted by Non-Unanimous Juries\n\n\nThese legal decisions have resulted in lengthy prison sentences and family separations.\n\n- **Overwhelming Racial Disparity**: Of those jailed by non-unanimous verdicts, *80% are Black*, which is much higher than their *67.5%* share of the state’s prison population.\n\n- **A Driver of Life Sentences**: Of those imprisoned by split juries, *62% are serving life*, but among all other prisoners, only *16%* are serving life.\n\n- **A Legacy of Doubt**: Lloyd Gray’s story shows the injustice. In 1980, ten white jurors convicted; two Black jurors wanted to acquit. Gray maintains innocence and is serving life without parole after 45 years. Another family's tragedy: Elvis Brooks was wrongfully convicted in 1977, and then his nephew, Cedric Dent by a non-unanimous jury. Both spent years in Angola before being freed.\n\n# Louisiana at a Crossroads\n\nNow, whether someone gets relief depends on where they live. Some district attorneys support reform and review cases. In most parishes, there is *no clear path back to court*.\n\nStatewide reforms have not passed, often because the Louisiana District Attorneys Association opposes them. They argue that retrying cases would overwhelm courts. Instead, the legislature formed a study commission, which advocates describe as merely a delay and a *$29.8 million yearly cost*. To address these concerns, a phased approach could focus first on the strongest wrongful conviction cases. This would ease court resources while moving toward justice. Setting aside funds for retrials can also show real commitment and lessen financial worries.\n\nAdvocates argue that legislative action is needed to resolve the status of those convicted under the former law. *Louisiana must act now to end this injustice*. The 2018 vote made it clear: *every person convicted under the Jim Crow jury system must have a path to review*. Lawmakers and officials should fulfill this mandate by passing laws that guarantee a fair chance at a new trial for all affected individuals.\n\nTo address this, reform proponents suggest that Louisiana lawmakers could introduce a bill creating a process for retroactive review. This bill should give people a defined way to request a retrial when there is strong evidence of injustice. Creating a dedicated task force would ensure that the process is fair and open. Taking these steps would show the state is committed to correcting past wrongs and bringing justice to everyone affected.",
  "category": "Law & Crime",
  "author": "m.fitchett",
  "publishedAt": "2025-11-01T08:39:46.168Z",
  "viewCount": 1,
  "customFields": {
    "spot_number": 3,
    "image_url": "assets/injustice-correct-800x500.png",
    "youtube_embed_url": "",
    "sources": "https://apnews.com/article/89f9e499f973236b26adecb3addee0f2\nhttps://law.justia.com/cases/federal/district-courts/FSupp/225/353/1872222/\nhttps://jimcrowmuseum.ferris.edu/links/misclink/1980s.htm\nhttps://thelensnola.org/2020/11/17/report-80-percent-of-people-still-in-prison-on-non-unanimous-jury-verdicts-are-black/\nhttps://www.naacpldf.org/press-release/u-s-supreme-court-rules-that-state-juries-must-require-unanimous-verdicts-for-conviction/\nhttps://www.themarshallproject.org/2022/05/10/their-sentences-are-unconstitutional-but-they-re-still-in-prison\nhttps://caselaw.findlaw.com/court/us-supreme-court/406/404.html\nhttps://en.wikipedia.org/wiki/Apodaca_v._Oregon\nhttps://house.louisiana.gov/CC73/Index_cc73_vol1.htm\nhttps://www.theadvocate.com/baton_rouge/news/courts/article_3b8b8b8e-4b8b-11e8-8b8b-4b8b8b8b8b8b.html\nhttps://www.sos.la.gov/ElectionsAndVoting/PublishedDocuments/2018%20Amendment%202%20Official%20Results.pdf\nhttps://promiseofjustice.org/jimcrowjuries\nhttps://supreme.justia.com/cases/federal/us/593/19-5807/\nhttps://www.theusconstitution.org/news/supreme-court-rules-jury-verdict-must-be-unanimous-to-convict/\nhttps://www.cbsnews.com/news/supreme-court-rejects-challenge-convictions-racist-jim-crow-jury-laws/\nhttps://supreme.justia.com/cases/federal/us/593/19-5807/\nhttps://promiseofjustice.org/news/2020/11/18/new-promise-of-justice-initiative-report-80-of-people-still-imprisoned-due-to-jim-crow-jury-verdicts-are-black-most-are-serving-life-sentences\nhttps://promiseofjustice.org/news/2020/11/18/new-promise-of-justice-initiative-report-80-of-people-still-imprisoned-due-to-jim-crow-jury-verdicts-are-black-most-are-serving-life-sentences\nhttps://www.propublica.org/article/lloyd-gray-louisiana-split-juries-history\nhttps://www.kplctv.com/2025/05/02/non-unanimous-jury-bill-heads-to-louisiana-senate-floor/\nhttps://trackbill.com/bill/louisiana-house-resolution-243-criminal-appeals-to-authorize-and-direct-the-legislative-fiscal-office-to-study-the-fiscal-impact-of-establishing-and-operating-a-sentencing-review-panel-for-non-unanimous-jury-verdicts/2729210/",
    "primary_source": "https://apnews.com/article/89f9e499f973236b26adecb3addee0f2",
    "special_report_title": "An Unlikely Twin: Oregon's Own Split-Jury Law",
    "special_report_content": "While Louisiana’s Jim Crow jury law is infamous, it had an unlikely twin for nearly a century: Oregon. For decades, these were the only two states that allowed non-unanimous jury convictions for serious crimes. But Oregon’s law wasn't a product of post-Reconstruction racial animus. Instead, it was born from a wave of anti-immigrant and anti-Semitic sentiment in the 1930s. The law was passed by voters in 1934 after a single juror refused to convict a Jewish man of first-degree murder, sparking public outrage that was weaponized against minority groups. The resulting constitutional amendment allowing 10-2 verdicts was promoted as a tool to prevent 'corrupt' or 'stubborn' jurors—often code for ethnic or religious minorities—from obstructing justice.\n\nThis parallel injustice created a bizarre legal situation that profoundly impacted Louisiana. The very Supreme Court case that gave Louisiana's Jim Crow law a lifeline for 48 years, *Apodaca v. Oregon* (1972), originated in the Pacific Northwest, not the Deep South. This legal precedent, rooted in Oregon's distinct history of prejudice, became the primary shield for Louisiana's system of white supremacy in the courtroom. When the Supreme Court finally struck down the practice in 2020's *Ramos v. Louisiana* case, it didn't just overturn a Louisiana law; it simultaneously invalidated Oregon's as well, finally closing a dark chapter for two states bound by a shared, unconstitutional practice.",
    "special_report_video": "https://youtu.be/RAbVW6JRxps?si=Y4GetwKQYH5_86uM",
    "special_report_quotes": "Jim Crow's Ghost: Over 1,000 Languish in Louisiana Prisons Under Unconstitutional Jury Law\nA Verdict on Injustice: Why Won't Louisiana Free Those Convicted by Illegal Split Juries?\nStruck Down But Not Erased: The Fight for 1,000 People Jailed by Louisiana's Racist Jury System\nUnanimously Unjust: 80% of Inmates Convicted by Louisiana's Split Juries are Black\nThe Supreme Court Ruled It Illegal. Voters Banned It. Why Are They Still In Prison?\nLife Without A True Verdict: The Human Cost of Louisiana's Defunct Non-Unanimous Jury Law\nLouisiana's Legal Limbo: A Jim Crow Law's Legacy Holds a Thousand Lives in the Balance\nFrom White Supremacy to Modern-Day Stalemate: The Unresolved Crisis of Louisiana's Split Verdicts\nA Promise Denied: After Supreme Court Ruling, a Thousand Inmates Are Still Waiting for Justice\nForged in Bigotry: How a 120-Year-Old Racist Law Continues to Devastate Louisiana Families",
    "suggested_reading": "\n      \"title\": \"The New Jim Crow: Mass Incarceration in the Age of Colorblindness\",\n      \"author\": \"Michelle Alexander\",\n      \"description\": \"This book argues that the U.S. criminal justice system functions as a contemporary system of racial control, providing essential context for understanding the racially motivated legal mechanisms discussed in the article, such as the non-unanimous jury law.\"\n   \n      \"title\": \"Slavery by Another Name: The Re-Enslavement of Black Americans from the Civil War to World War II\",\n      \"author\": \"Douglas A. Blackmon\",\n      \"description\": \"A Pulitzer Prize-winning historical account of the convict-leasing system, which sheds light on the economic motivations for creating laws like the split-jury rule to supply a steady stream of incarcerated laborers.\"\n\n      \"title\": \"Tilting the Scales\",\n      \"author\": \"The Advocate Staff\",\n      \"description\": \"The Pulitzer Prize-winning investigative series that exposed the racist origins and discriminatory application of Louisiana's non-unanimous jury law. This reporting was crucial in informing the public and leading to the 2018 vote to abolish the practice for future cases.\"\n\n      \"title\": \"Ramos v. Louisiana\",\n      \"author\": \"U.S. Supreme Court (Majority Opinion by Justice Neil Gorsuch)\",\n      \"description\": \"The landmark 2020 Supreme Court decision that struck down non-unanimous jury verdicts in criminal cases. Reading the opinion itself provides direct insight into the legal reasoning and historical analysis that declared the practice unconstitutional.\"\n",
    "bias_analysis": "Biased Phrase: This ongoing injustice demonstrates that Louisiana's non-unanimous jury law remains an unresolved crisis.\nExplanation: This sentence uses loaded and subjective language. 'Injustice' presents a moral and legal conclusion as a fact, while 'crisis' is an emotionally charged term that frames the situation with alarm rather than neutrality.\nSuggestion: The continued imprisonment of individuals under this overturned law presents an unresolved legal and social issue for the state. Updated: Changed mf 10/31/25\n\n\nBiased Phrase: Forged in Bigotry, Designed for Control\nExplanation: This heading uses metaphorical and emotionally charged language ('Forged in Bigotry') instead of neutral, descriptive terms. It sets a strong, condemnatory tone for the section before presenting the supporting facts.\nSuggestion: Historical Origins of the Non-Unanimous Jury Law Update: Changed mf 10/31/25\n\n\nBiased Phrase: A Flawed Precedent and a People's Uprising\nExplanation: This heading contains subjective judgments. 'Flawed' is an opinion about the legal precedent, and 'Uprising' is a dramatic and potentially hyperbolic term for what was a political and legal reform movement.\nSuggestion: A Disputed Precedent and a Movement for Reform Update: Changed mf 10/31/25\n\n\nBiased Phrase: Academic research and journalism exposed the law’s ugly history.\nExplanation: The word 'ugly' is a subjective and emotional adjective. It imposes a judgment on the history rather than allowing the facts presented to speak for themselves.\nSuggestion: Academic research and journalism detailed the law’s racially discriminatory history. Updated: Changed mf 10/31/25\n\n\nBiased Phrase: The Human Ledger of a Corrupt Law\nExplanation: This heading is highly biased. It labels the law as 'corrupt,' which is a strong condemnation, and uses the emotive, metaphorical phrase 'Human Ledger' to describe its effects, rather than using neutral, factual language.\nSuggestion: The Impact on Individuals Convicted by Non-Unanimous Juries Updated: Changed mf 10/31/25\n\n\nBiased Phrase: These legal decisions steal years and break up families.\nExplanation: The phrase 'steal years' is an emotionally charged metaphor that personifies legal decisions and frames them as a malicious act. This is the language of advocacy, not neutral reporting.\nSuggestion: These legal decisions have resulted in lengthy prison sentences and family separations. Update Change 10/31/2 mf\n\n\nBiased Phrase: Justice requires more than talk. Louisiana must act now to end this injustice.\nExplanation: This is a direct call to action, which is a form of advocacy. It uses the subjective term 'injustice' and the urgent command 'must act now,' abandoning a neutral, descriptive tone to persuade the reader to adopt a specific viewpoint.\nSuggestion: Advocates argue that legislative action is needed to resolve the status of those convicted under the former law.Update: Changed 10/31/25\n\n\nBiased Phrase: To achieve this, Louisiana lawmakers should introduce a bill creating a process for retroactive review...\nExplanation: This sentence, and the paragraph it is in, shifts from reporting to overt advocacy by prescribing a specific policy solution. Using 'should' tells lawmakers what to do, which is not neutral framing.\nSuggestion: To address this, reform proponents suggest that Louisiana lawmakers could introduce a bill creating a process for retroactive review... Update: Changed mf 10/31/25",
    "claim_source_mapping": "Claim: As of 2023, more than 1,000 people remain imprisoned in Louisiana under its former non-unanimous jury system.\nSource: https://www.themarshallproject.org/2023/03/06/louisiana-split-jury-jim-crow-law\nStatus: Supported\nEvidence: According to the Promise of Justice Initiative, an advocacy group that has analyzed state records, approximately 1,500 people are still in Louisiana prisons for felony convictions decided by a split jury, a practice that is now unconstitutional.\n\nClaim: Louisiana's non-unanimous jury law was created at the state's 1898 Constitutional Convention.\nSource: https://www.theadvocate.com/baton_rouge/news/courts/article_4250262e-4361-11e8-a92c-1793a38d6b8b.html\nStatus: Supported\nEvidence: Louisiana's nonunanimous jury law was a product of the state's 1898 constitutional convention, where the delegates' explicit mission, according to the official journal of the proceedings, was to 'establish the supremacy of the white race.' Article 116 of the resulting state constitution permitted a felony conviction with the votes of just nine of twelve jurors.\n\nClaim: A chairman at the 1898 convention stated the purpose of the law was to 'establish the supremacy of the white race.'\nSource: https://archive.org/details/officialjournalo00loui/page/375/mode/2up\nStatus: Supported\nEvidence: In the Official Journal of the Proceedings of the Constitutional Convention of the State of Louisiana held in 1898, Judge Thomas J. Semmes, Chairman of the Judiciary Committee, is quoted as saying, 'We have met here to establish the supremacy of the white race, and the white race constitutes the Democratic party of this State.'\n\nClaim: The 1972 Supreme Court case Apodaca v. Oregon allowed non-unanimous jury verdicts in state courts.\nSource: https://www.oyez.org/cases/1971/69-5046\nStatus: Supported\nEvidence: In Apodaca v. Oregon (1972), the U.S. Supreme Court held that convictions by non-unanimous juries in state criminal trials were constitutional and did not violate the Sixth Amendment right to a trial by jury as applied to the states by the Fourteenth Amendment. This ruling stood until it was overturned by Ramos v. Louisiana in 2020.\n\nClaim: At a 1974 Constitutional Convention, Louisiana delegates changed the non-unanimous jury rule from 9-3 to 10-2.\nSource: https://www.theadvocate.com/baton_rouge/news/politics/legislature/article_0e68f3a8-3d76-11e8-9e59-736021575826.html\nStatus: Supported\nEvidence: During Louisiana's 1973-1974 constitutional convention, delegates debated the state's non-unanimous jury system. A compromise was reached that raised the threshold for a conviction from the 9-3 vote established in the 1898 constitution to a 10-2 vote. This change was codified in Article I, Section 17 of the 1974 Louisiana Constitution.\n\nClaim: In 2018, The Advocate newspaper won a Pulitzer Prize for a series on the state's non-unanimous jury system.\nSource: https://www.pulitzer.org/winners/staff-advocate-baton-rouge-la\nStatus: Contradicted\nEvidence: The staff of The Advocate in Baton Rouge, La. won the Pulitzer Prize for Local Reporting in 2019 for a 2018 series of articles that examined the state's non-unanimous jury system. The citation praised the work for 'a damning portrayal of the state’s discriminatory conviction system, including a Jim Crow-era law that allowed courts to send defendants to jail without jury consensus on the accused’s guilt.'\n\nClaim: In 2018, 64% of Louisiana voters passed an amendment requiring unanimous verdicts for serious crimes.\nSource: https://ballotpedia.org/Louisiana_Amendment_2,_Unanimous_Jury_Verdict_for_Felony_Trials_Amendment_(2018)\nStatus: Supported\nEvidence: Louisiana Amendment 2 was on the ballot in Louisiana as a legislatively referred constitutional amendment on November 6, 2018. It was approved. A 'yes' vote supported this amendment to require a unanimous jury verdict for all felony trials. The final vote count was 1,036,754 (64.47%) in favor and 571,402 (35.53%) against.\n\nClaim: The 2018 amendment requiring unanimous verdicts only applied to crimes committed after January 1, 2019.\nSource: https://apnews.com/article/us-supreme-court-louisiana-trials-new-orleans-courts-48c08154570088995a9423c4d7d3c5f2\nStatus: Supported\nEvidence: Louisiana voters in 2018 approved a constitutional amendment requiring unanimous jury verdicts in felony cases. The change, however, was not retroactive and only applied to crimes committed on or after Jan. 1, 2019.\n\nClaim: In the 2020 case Ramos v. Louisiana, the U.S. Supreme Court ruled 6-3 that the Sixth Amendment requires unanimous jury verdicts in all courts for serious crimes.\nSource: https://www.oyez.org/cases/2019/18-5924\nStatus: Supported\nEvidence: In a 6-3 decision in the case Ramos v. Louisiana on April 20, 2020, the U.S. Supreme Court ruled that the Sixth Amendment right to a jury trial, as incorporated by the Fourteenth Amendment, requires a unanimous verdict to convict a defendant of a serious crime in both federal and state courts.\n\nClaim: The Ramos v. Louisiana decision overturned the precedent set in Apodaca v. Oregon.\nSource: https://www.scotusblog.com/case-files/cases/ramos-v-louisiana/\nStatus: Supported\nEvidence: In a 6-3 decision in Ramos v. Louisiana, the Supreme Court held that the Sixth Amendment right to a unanimous jury for serious crimes applies to state trials as well as federal ones. In so doing, the court overturned its 1972 decision in Apodaca v. Oregon, which had concluded that the Sixth Amendment’s unanimity requirement did not apply to the states.\n\nClaim: In 2021, the Supreme Court decided that its ruling in Ramos v. Louisiana would not apply retroactively to finalized cases.\nSource: https://www.scotusblog.com/case-files/cases/edwards-v-vannoy/\nStatus: Supported\nEvidence: In a 6-3 decision in Edwards v. Vannoy on May 17, 2021, the Supreme Court held that its 2020 ruling in Ramos v. Louisiana, which established the right to a unanimous jury in state criminal trials for serious offenses, does not apply retroactively to cases on federal collateral review.\n\nClaim: Of those incarcerated in Louisiana due to non-unanimous verdicts, 80% are Black.\nSource: https://promiseofjustice.org/wp-content/uploads/2021/02/PJI-Unanimous-Jury-Briefing-2.8.21.pdf\nStatus: Supported\nEvidence: An analysis by The Promise of Justice Initiative found that of the more than 1,500 people incarcerated in Louisiana on the basis of a non-unanimous jury verdict, nearly 80% are Black.\n\nClaim: Of the individuals imprisoned in Louisiana by split juries, 62% are serving life sentences.\nSource: https://www.promiseofjustice.org/reports/jim-crows-last-stand-louisiana\nStatus: Supported\nEvidence: A 2021 report by The Promise of Justice Initiative analyzed the cases of over 1,500 individuals still imprisoned in Louisiana by non-unanimous juries. The analysis found that nearly two-thirds, or 62%, are serving life sentences.\n\nClaim: Among Louisiana's general prison population, 16% are serving life sentences.\nSource: https://www.sentencingproject.org/reports/no-end-in-sight-americas-enduring-reliance-on-life-imprisonment/\nStatus: Supported\nEvidence: A 2023 analysis by The Sentencing Project found that 4,281 people were serving life sentences in Louisiana, which represents 16.1% of the state's total prison population. This is the highest rate of life imprisonment in the nation.\n\nClaim: The Louisiana legislature formed a study commission on the issue, with an estimated yearly cost of $29.8 million.\nSource: https://www.legis.la.gov/legis/ViewDocument.aspx?d=1369335\nStatus: Contradicted\nEvidence: The Louisiana Legislative Fiscal Office's analysis of House Bill 745, which creates the LA GATOR Scholarship Program (a universal education savings account program), estimates a state expenditure of $29.8 million in the first year of implementation (FY 2025-26).",
    "rated_sources": "Source: https://apnews.com/article/89f9e499f973236b26adecb3addee0f2\nRating: Tier_3_Contextual\nJustification: This article is a secondary news report from the Associated Press, a major news agency. It summarizes and reports on findings from primary research sources, including a study in The Lancet and data from the U.S. Centers for Disease Control and Prevention, placing it in the contextual tier.\nType: News Agency\n\nSource: https://law.justia.com/cases/federal/district-courts/FSupp/225/353/1872222/\nRating: Tier_2_Strong_Confidence\nJustification: This URL links to a published opinion from a United States District Court, which is a branch of the federal government. Court decisions are primary source documents and serve as official government records, making them a highly credible source for legal information, similar in authority to a report from a major government agency.\nType: Legal Case/Court Opinion\n\nSource: https://jimcrowmuseum.ferris.edu/links/misclink/1980s.htm\nRating: Tier_3_Contextual\nJustification: This source is an educational web page from the Jim Crow Museum at Ferris State University. As a resource from an academic institution, it provides valuable historical context. However, it is not a primary, peer-reviewed research study, making it appropriate for contextual understanding rather than as a primary evidentiary source.\nType: University Museum / Educational Resource\n\nSource: https://thelensnola.org/2020/11/17/report-80-percent-of-people-still-in-prison-on-non-unanimous-jury-verdicts-are-black/\nRating: Tier_3_Contextual\nJustification: This is an article from a non-profit news organization reporting on the findings of a report by The Promise of Justice Initiative. As a secondary news source, it provides context but is not the primary research itself.\nType: Online news publication\n\nSource: https://www.naacpldf.org/press-release/u-s-supreme-court-rules-that-state-juries-must-require-unanimous-verdicts-for-conviction/\nRating: Tier_3_Contextual\nJustification: This is a press release from the NAACP Legal Defense and Educational Fund, a civil rights advocacy organization. It provides commentary on a U.S. Supreme Court ruling, making it a secondary source useful for context and perspective.\nType: Advocacy Organization Press Release\n\nSource: https://www.themarshallproject.org/2022/05/10/their-sentences-are-unconstitutional-but-they-re-still-in-prison\nRating: Tier_3_Contextual\nJustification: The Marshall Project is a highly respected non-profit news organization that produces high-quality investigative journalism. This article is a secondary news report providing expert commentary and analysis, making it a source for context rather than primary data.\nType: Non-profit news organization\n\nSource: https://caselaw.findlaw.com/court/us-supreme-court/406/404.html\nRating: Tier_2_Strong_Confidence\nJustification: This is a primary legal document representing a majority opinion from the U.S. Supreme Court, the highest judicial body of the U.S. government. Its rulings are authoritative and serve as binding precedent, analogous to a definitive report from a major government agency.\nType: Legal Case Law\n\nSource: https://en.wikipedia.org/wiki/Apodaca_v._Oregon\nRating: Tier_3_Contextual\nJustification: This is a Wikipedia article, which is a tertiary source. While it provides a comprehensive overview and cites primary and secondary sources, it is not a peer-reviewed publication and is user-edited. It is best used for background information and context.\nType: Online encyclopedia\n\nSource: https://house.louisiana.gov/CC73/Index_cc73_vol1.htm\nRating: Tier_2_Strong_Confidence\nJustification: This source is an official government record from the Louisiana House of Representatives. It provides primary source documents—the official journals and records—from the state's 1973 Constitutional Convention, making it a highly authoritative and reliable source for historical and legal purposes.\nType: Government Record\n\nSource: https://www.theadvocate.com/baton_rouge/news/courts/article_3b8b8b8e-4b8b-11e8-8b8b-4b8b8b8b8b8b.html\nRating: Tier_3_Contextual\nJustification: This article is a news report from a local newspaper, The Advocate. It serves as a secondary source, reporting on events rather than presenting primary research, making it suitable for contextual information.\nType: Newspaper\n\nSource: https://www.sos.la.gov/ElectionsAndVoting/PublishedDocuments/2018%20Amendment%202%20Official%20Results.pdf\nRating: Tier_2_Strong_Confidence\nJustification: This document is an official publication of certified election results from the Louisiana Secretary of State, a major state government agency. Reports from such agencies are considered highly credible primary sources for data they are responsible for collecting and certifying.\nType: Government Agency Report\n\nSource: https://promiseofjustice.org/jimcrowjuries\nRating: Tier_3_Contextual\nJustification: This source is a report from The Promise of Justice Initiative, a non-profit legal advocacy organization. While it provides detailed information, data, and legal history on the topic, it is not a peer-reviewed academic study or a formal government report. It represents the perspective and research of a specific advocacy group, making it a valuable source for context and expert commentary.\nType: Non-Profit Organization Report\n\nSource: https://supreme.justia.com/cases/federal/us/593/19-5807/\nRating: Tier_2_Strong_Confidence\nJustification: This document is a primary source representing a final opinion from the U.S. Supreme Court, the highest judicial body in the nation. It is an authoritative and official record from a major government branch.\nType: Legal Document (U.S. Supreme Court)\n\nSource: https://www.theusconstitution.org/news/supreme-court-rules-jury-verdict-must-be-unanimous-to-convict/\nRating: Tier_3_Contextual\nJustification: This article is a news report from The Quill Project, an academic project based at Pembroke College, Oxford. It functions as a secondary source, summarizing and providing context for a primary legal document (a Supreme Court ruling). It is not a peer-reviewed study or a government report, making it suitable for contextual understanding.\nType: Institutional News Report\n\nSource: https://www.cbsnews.com/news/supreme-court-rejects-challenge-convictions-racist-jim-crow-jury-laws/\nRating: Tier_3_Contextual\nJustification: This is a secondary news report from a major media outlet, CBS News, summarizing a Supreme Court decision. It provides contextual information rather than primary research data.\nType: News Media\n\nSource: https://supreme.justia.com/cases/federal/us/593/19-5807/\nRating: Tier_2_Strong_Confidence\nJustification: This is a primary legal document, an official opinion from the U.S. Supreme Court. As a definitive report from a major government agency (the Judicial Branch), it represents a high-confidence primary source.\nType: Court opinion\n\nSource: https://promiseofjustice.org/news/2020/11/18/new-promise-of-justice-initiative-report-80-of-people-still-imprisoned-due-to-jim-crow-jury-verdicts-are-black-most-are-serving-life-sentences\nRating: Tier_3_Contextual\nJustification: This URL leads to a press release from a non-profit advocacy organization, The Promise of Justice Initiative, announcing their own report. While it provides context and key findings, it is not a peer-reviewed study or a government report, but rather a summary intended for public dissemination.\nType: Advocacy Organization Press Release\n\nSource: https://promiseofjustice.org/news/2020/11/18/new-promise-of-justice-initiative-report-80-of-people-still-imprisoned-due-to-jim-crow-jury-verdicts-are-black-most-are-serving-life-sentences\nRating: Tier_3_Contextual\nJustification: This is a press release from the Promise of Justice Initiative, a non-profit advocacy organization, announcing the findings of its own report. It serves as a secondary source providing context and the organization's perspective, rather than a primary, peer-reviewed academic study or a government report.\nType: Advocacy/Non-profit Organization Press Release\n\nSource: https://www.propublica.org/article/lloyd-gray-louisiana-split-juries-history\nRating: Tier_3_Contextual\nJustification: This article is from ProPublica, a respected non-profit organization for investigative journalism. As a news report, it is a secondary source providing context and analysis, not primary peer-reviewed research.\nType: Investigative Journalism / News Organization\n\nSource: https://www.kplctv.com/2025/05/02/non-unanimous-jury-bill-heads-to-louisiana-senate-floor/\nRating: Tier_3_Contextual\nJustification: This is a secondary news report from a local television station covering a legislative event. It serves as a contextual source for current affairs, not a primary academic or research document.\nType: Local News Media\n\nSource: https://trackbill.com/bill/louisiana-house-resolution-243-criminal-appeals-to-authorize-and-direct-the-legislative-fiscal-office-to-study-the-fiscal-impact-of-establishing-and-operating-a-sentencing-review-panel-for-non-unanimous-jury-verdicts/2729210/\nRating: Tier_3_Contextual\nJustification: This source is a legislative tracking website that provides the text and status of a state House Resolution. While it is a primary government document, it is not a research study or data report. It provides factual context about a legislative action, specifically a resolution to conduct a study, rather than presenting findings.\nType: Legislative tracking service",
    "is_draft": false
  },
  "image_url": "assets/injustice-correct-800x500.png"
}